/*-----------------------------------------------------------------------------------------------------
【平 台】Keil
【适 用 单 片 机】msp432P401R
【底 层 库】msp432_driverlib_3_21_00_05
【开 发】lv
* @@ 库仅供参考 后果自负
* 板载UART资源介绍
* UART0 :   RXD:P1.2   TXD:P1.3     连接着调试器的
* UART1 :   RXD:P2.2   TXD:P2.3 
* UART2 :   RXD:P3.2   TXD:P3.3 
* UART3 :   RXD:P9.6   TXD:P9.7 
* 版本 v1.0
* 时间 2022年12月27日16:39:03
-------------------------------------------------------------------------------------------------------*/
#ifndef __MYUART_H__
#define __MYUART_H__


typedef enum 
{
    UART0 = 0,
    UART1 = 1,
    UART2 = 2,
    UART3 = 3,
}UARTx;

void uart_init(UARTx UARTx);
#endif
